Repository: lyfu19/online-ticket-system
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: mi

source: Please fill out all fields!
mi: Tēnā koa whakakīa ngā āpure katoa!

source: Username or email already exists!
mi: Kua noho kē te ingoa kaiwhakamahi, te īmēra rānei!

source: Registration successful!
mi: Kua angitū te rēhitatanga!

source: Login successful!
mi: Kua angitū te takiuru!

source: Login failed, please try again.
mi: I rahua te takiuru, tēnā whakamātauria anō.

source: Invalid username or password!
mi: He hē te ingoa kaiwhakamahi, te kupuhipa rānei!

source: You have been logged out.
mi: Kua takiuru-kore koe.

source: Current password is incorrect!
mi: He hē te kupuhipa o nāianei!

source: Settings updated successfully!
mi: Kua whakahoungia ngā tautuhinga i angitū ai!

source: Settings page
mi: Whārangi tautuhinga

source: Please log in to purchase tickets.
mi: Tēnā takiuru ki te hoko tīkiti.

source: Please select a ticket type and concert!
mi: Tēnā kōwhiria he momo tīkiti me te konohete!

source: Invalid ticket type!
mi: He hē te momo tīkiti!

source: Concert not found!
mi: Kāore i kitea te konohete!

source: Not enough tickets available!
mi: Kāore he nui o ngā tīkiti e wātea ana!

source: Purchase successful!
mi: Kua angitū te hoko!

source: Online Ticketing System
mi: Pūnaha Tīkiti Ipurangi

source: Welcome,
mi: Nau mai,

source: Logout
mi: Takiuru-kore

source: Register
mi: Rēhita

source: Sign In
mi: Takiuru

source: Personal Settings
mi: Ngā Tautuhinga Whaiaro

source: Language Settings
mi: Ngā Tautuhinga Reo

source: All Rights Reserved.
mi: Katoa ngā Motika i Rāhuitia.

source: If you have any questions, please contact us at
mi: Mēnā he pātai āu, tēnā whakapā mai ki

source: Details
mi: Ngā Taipitopito

source: Concert Detail
mi: Ngā Taipitopito Konohete

source: Cover
mi: Uhi

source: Artist:
mi: Kaiwaiata:

source: Venue:
mi: Wāhi:

source: City:
mi: Tāone:

source: Date:
mi: Rā:

source: Select Ticket Type:
mi: Kōwhiria te Momo Tīkiti:

source: Regular
mi: Auau

source: Select Quantity:
mi: Kōwhiria te Rahinga:

source: Buy Tickets
mi: Hokona ngā Tīkiti

source: Available Concerts
mi: Ngā Konohete e Wātea Ana

source: by
mi: nā

source: Regular:
mi: Auau:

source: View Details
mi: Tirohia ngā Taipitopito

source: Previous
mi: O Mua

source: Next
mi: O Muri

source: Home
mi: Kāinga

source: Concert Tickets
mi: Ngā Tīkiti Konohete

source: Flight Tickets
mi: Ngā Tīkiti Rererangi

source: Promotions and Popular Events
mi: Ngā Whakatairanga me Ngā Takunetanga Rongonui

source: Flight Image
mi: Whakaahua Rererangi

source: Concert Image
mi: Whakaahua Konohete

source: Movie Image
mi: Whakaahua Kiriata

source: Login
mi: Takiuru

source: Username:
mi: Ingoa Kaiwhakamahi:

source: Password:
mi: Kupuhipa:

source: Email:
mi: Īmēra:

source: Confirm Password:
mi: Whakauhia te Kupuhipa:

source: User Information Settings
mi: Ngā Tautuhinga Mōhiohio Kaiwhakamahi

source: Current Password:
mi: Kupuhipa o Nāianei:

source: New Password:
mi: Kupuhipa Hou:

source: Confirm New Password:
mi: Whakauhia te Kupuhipa Hou:

source: Save Settings
mi: Tiakina ngā Tautuhinga

source: Success
mi: Angitū

source: Your ticket purchase was successful!
mi: Kua angitū tō hoko tīkiti!

source: OK
mi: ĀE

source: Select Language
mi: Kōwhiria te Reo

source: Please choose your preferred language:
mi: Tēnā kōwhiria tō reo pai:

source: English
mi: Reo Pākehā

source: Māori
mi: Reo Māori
